<?php

use yii\db\Migration;

class m210301_150325_create_table_auditory extends Migration
{
    public function up()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            $tableOptions = 'CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci ENGINE=InnoDB';
        }

        $this->createTable('{{%auditory_cat}}', [
            'id' => $this->primaryKey(8)->unsigned(),
            'name' => $this->string(128)->notNull(),
            'description' => $this->string(256)->notNull(),
            'study_flag' => $this->tinyInteger(1)->notNull()->defaultValue('0'),
        ], $tableOptions);

        $this->db->createCommand()->batchInsert('{{%auditory_cat}}', ['id', 'name', 'description','study_flag'], [
            [1, 'Аудитории и классы', '', 1],
            [2, 'Залы', '', 1],
            [3, 'Кабинеты', '', 1],
            [4, 'Служебные помещения', '', 0],
            [5, 'Складские помещения', '', 0],
            [6, 'Подсобные помещения', '', 0],
            [7, 'Коридоры и холлы', '', 1],
            [8, 'Другие помещения', '', 0],
            [9, 'Условные классы', '', 1],
            [10, 'Технические помещения', '', 0],
            [11, 'Филиал школы', 'помещения Художественного отделения', 1],
        ])->execute();

        $this->createTable('{{%auditory_building}}', [
            'id' => $this->primaryKey(8)->unsigned(),
            'name' => $this->string(128)->notNull(),
            'slug' => $this->string(64)->notNull(),
            'address' => $this->string()->notNull(),
        ], $tableOptions);

        $this->db->createCommand()->batchInsert('{{%auditory_building}}', ['id', 'name', 'slug', 'address'], [
            [1, 'Основное здание', 'ОЗ', 'Митинская ул. д.47, кор.1'],
            [2, 'Филиал', 'Ф', 'Пятницкое шоссе, д. 40'],
        ])->execute();

        $this->createTable('{{%auditory}}', [
            'id' => $this->primaryKey(8)->unsigned(),
            'building_id' => $this->integer(8)->unsigned()->notNull(),
            'cat_id' => $this->integer(8)->unsigned(),
            'num' => $this->integer(3),
            'name' => $this->string(128),
            'floor' => $this->string(32)->notNull(),
            'area' => $this->float()->notNull(),
            'capacity' => $this->integer(3)->notNull(),
            'description' => $this->string(),
            'status' => $this->integer(8)->notNull()->defaultValue('10'),
            'sortOrder' => $this->integer(8)->unsigned()->notNull(),
        ], $tableOptions);

        $this->db->createCommand()->batchInsert('{{%auditory}}', ['id', 'building_id', 'cat_id', 'num', 'name',
            'floor', 'area', 'capacity', 'description', 'status', 'sortOrder'], [
            [1, 1, 9, 0, 'По классам', '1', 0, 0, '', 10, 43],
            [36, 2, 11, 1, 'Класс архитектуры', '1', 20.3, 10, '', 10, 37],
            [37, 2, 11, 10, 'Класс скульптуры', '1', 20, 10, 'Художественная керамика', 10, 36],
            [38, 2, 11, 11, 'ИЗО', '1', 20.1, 12, '', 10, 40],
            [39, 2, 11, 12, 'ИЗО', '1', 19.9, 12, '', 10, 38],
            [40, 2, 11, 2, 'Класс развития', '1', 20.3, 6, 'Мандариновое детство', 10, 39],
            [41, 2, 11, 3, 'Класс развития', '1', 21.2, 8, 'Мандариновое детство', 10, 42],
            [42, 2, 11, 4, 'Класс развития', '1', 14.8, 7, 'Мандариновое детство', 10, 43],
            [43, 2, 11, 5, 'Администраторы', '1', 12.2, 0, '', 10, 41],
            [44, 2, 11, 6, 'Учительская', '1', 12.3, 0, '', 10, 45],
            [45, 2, 11, 7, 'Лаборатория', '1', 9.7, 0, 'Художественная керамика', 10, 44],
            [46, 2, 11, 8, 'ИЗО', '1', 21.1, 12, '', 10, 47],
            [47, 2, 11, 9, 'ИЗО', '1', 14.8, 8, '', 10, 56],
            [52, 1, 1, 106, 'Класс композиции', '1', 32.9, 14, '', 10, 53],
            [53, 1, 1, 107, 'Класс скульптуры', '1', 31.9, 14, '', 10, 52],
            [54, 1, 1, 109, 'Класс живописи', '1', 42, 14, '', 10, 65],
            [55, 1, 1, 110, 'Класс живописи', '1', 35.8, 14, '', 10, 55],
            [56, 1, 1, 111, 'Класс рисунка', '1', 40.9, 14, '', 10, 46],
            [57, 1, 1, 114, 'Класс теоретических дисциплин', '1', 27.5, 14, '', 10, 0],
            [58, 1, 1, 115, 'Класс теоретических дисциплин', '1', 39.6, 14, '', 10, 0],
            [59, 1, 1, 116, 'Класс теоретических дисциплин', '1', 38.1, 14, '', 10, 0],
            [60, 1, 1, 117, 'Хоровой класс', '1', 50.3, 0, 'Музыкальный фольклор', 10, 0],
            [61, 1, 1, 119, 'Художественный фонд', '1', 13.2, 0, '', 10, 0],
            [62, 1, 1, 120, 'Класс теоретических дисциплин', '1', 25.5, 14, '', 10, 0],
            [63, 1, 1, 121, 'Класс теоретических дисциплин', '1', 35.9, 14, '', 10, 0],
            [64, 1, 2, 103, 'Малый зал', '1', 93.8, 0, '', 10, 105],
            [65, 1, 3, 201, 'Кабинет директора', '2', 29, 0, '', 10, 67],
            [66, 1, 1, 205, 'Класс индивидуальных занятий', '2', 29.6, 0, '', 10, 54],
            [67, 1, 1, 206, 'Класс индивидуальных занятий', '2', 28.2, 0, 'Фортепиано', 10, 66],
            [68, 1, 1, 207, 'Класс индивидуальных занятий', '2', 26.7, 0, 'Фортепиано', 10, 0],
            [69, 1, 1, 208, 'Класс индивидуальных занятий', '2', 28, 0, 'Фортепиано', 10, 0],
            [70, 1, 1, 209, 'Класс индивидуальных занятий', '2', 27.9, 0, 'Фортепиано', 10, 0],
            [71, 1, 1, 210, 'Класс индивидуальных занятий', '2', 16.5, 0, 'Арфа', 10, 0],
            [72, 1, 1, 211, 'Класс индивидуальных занятий', '2', 21.2, 0, 'Фортепиано', 10, 0],
            [73, 1, 1, 212, 'Класс ансамбля', '2', 46.6, 0, 'Народные инструменты', 10, 0],
            [74, 1, 1, 213, 'Класс индивидуальных занятий', '2', 25.2, 0, 'Духовые инструменты', 10, 0],
            [75, 1, 1, 214, 'Класс индивидуальных занятий', '2', 25.7, 0, 'Духовые инструменты', 10, 0],
            [76, 1, 1, 215, 'Класс индивидуальных занятий', '2', 26.9, 0, 'Духовые инструменты', 10, 0],
            [77, 1, 1, 216, 'Класс ансамбля', '2', 30.2, 0, 'Струнные инструменты', 10, 0],
            [78, 1, 1, 217, 'Класс индивидуальных занятий', '2', 10.7, 0, '', 10, 0],
            [79, 1, 1, 220, 'Класс индивидуальных занятий', '2', 15.3, 0, '', 10, 0],
            [81, 1, 1, 219, 'Класс индивидуальных занятий', '2', 12, 0, '', 10, 0],
            [82, 1, 1, 218, 'Класс индивидуальных занятий', '2', 29.2, 0, '', 10, 0],
            [83, 1, 1, 221, 'Класс духового оркестра', '2', 64.9, 0, '', 10, 0],
            [84, 1, 3, 222, 'Инженерная служба', '2', 19.3, 0, '', 10, 0],
            [85, 1, 3, 104, 'Кабинет зам. директора по АХР', '1', 23, 0, '', 10, 0],
            [86, 1, 3, 105, 'Кабинет зам. директора', '1', 36, 0, '', 10, 0],
            [87, 1, 3, 122, 'Кабинет зам. директора по кадрам', '1', 16, 0, '', 10, 0],
            [88, 1, 3, 202, 'Кабинет зам. директора по оргвопросам', '2', 12, 0, '', 10, 0],
            [89, 1, 3, 203, 'Кабинет главного бухгалтера', '2', 16, 0, '', 10, 0],
            [90, 1, 3, 204, 'Бухгалтерия', '2', 37, 0, '', 10, 0],
            [91, 1, 2, 302, 'Большой Зал', '3', 362, 283, '', 10, 168],
            [92, 1, 1, 303, 'Хоровой класс', '3', 85, 0, '', 10, 0],
            [93, 1, 1, 304, 'Класс индивидуальных занятий', '3', 23.9, 0, 'Фортепиано', 10, 0],
            [94, 1, 1, 305, 'Класс индивидуальных занятий', '3', 23.8, 0, 'Фортепиано', 10, 0],
            [95, 1, 1, 306, 'Класс индивидуальных занятий', '3', 23.1, 0, 'Фортепиано', 10, 0],
            [96, 1, 3, 312, 'Компьютерный класс', '3', 37.3, 14, '', 10, 0],
            [97, 1, 3, 313, 'Библиотека', '3', 19.6, 0, '', 10, 0],
            [98, 1, 1, 314, 'Класс индивидуальных занятий', '3', 15.8, 0, 'Вокал', 10, 0],
            [99, 1, 1, 317, 'Класс хореографии', '3', 85, 0, '', 10, 0],
            [100, 1, 1, 333, 'Класс индивидуальных занятий', '3', 20, 0, 'Фортепиано', 10, 0],
            [101, 1, 1, 336, 'Класс хореографии', '3', 77.9, 0, '', 10, 0],
            [102, 1, 1, 350, 'Класс индивидуальных занятий', '3', 20, 0, '', 10, 0],
            [103, 1, 1, 351, 'Класс индивидуальных занятий', '3', 15.9, 0, 'Народные инструменты', 10, 0],
            [104, 1, 1, 358, 'Класс индивидуальных занятий', '3', 11.3, 0, '', 10, 0],
            [105, 1, 1, 357, 'Класс индивидуальных занятий', '3', 12.1, 0, '', 10, 0],
            [106, 1, 1, 356, 'Класс индивидуальных занятий', '3', 15, 0, 'Фортепиано', 10, 0],
            [107, 1, 1, 355, 'Класс индивидуальных занятий', '3', 10, 0, '', 10, 0],
            [108, 1, 1, 347, 'Класс эстрадно-джазового оркестра', '3', 37.7, 0, '', 10, 0],
            [109, 1, 1, 346, 'Класс ударных инструментов', '3', 26.7, 0, '', 10, 0],
            [110, 1, 4, 401, 'Помещение множительной техники', '4', 0, 0, '', 10, 0],
            [111, 1, 4, 232, 'Серверная', '2', 0, 0, '', 10, 0],
            [112, 1, 7, 102, 'Вестибюль 1-го этажа', '1', 0, 0, '', 10, 0],
            [113, 1, 7, 101, 'Помещение охраны', '1', 0, 0, '', 10, 0],
            [114, 1, 7, 200, 'Вестибюль 2-го этажа', '2', 0, 0, '', 10, 0],
            [115, 1, 7, 301, 'Вестибюль 3-го этажа', '3', 0, 0, 'Музей', 10, 0],
            [116, 1, 10, 515, 'Мастерская', '0', 0, 0, '', 10, 0],
            [117, 1, 8, 112, 'Буфет', '1', 0, 0, '', 10, 0],
            [118, 1, 7, 141, 'Холл 1-го этажа', '1', 0, 0, 'Для выставок ИЗО', 10, 0],
            [119, 1, 7, 241, 'Холл 2-го этажа', '2', 0, 0, 'Для выставок ИЗО', 10, 0],
            [120, 1, 7, 332, 'Холл 3-го этажа', '3', 0, 0, 'Для высавок ИЗО', 10, 0],
            [121, 1, 3, 503, 'Массажный кабинет', '0', 0, 0, '', 10, 0],
            [122, 1, 2, 501, 'Тренажерный зал', '0', 81.1, 0, '', 10, 0],
            [123, 1, 3, 502, 'Тренерская', '0', 6.1, 0, '', 10, 0],
            [124, 1, 3, 513, 'Кабинет', '0', 0, 0, '', 10, 0],
            [125, 1, 4, 511, 'Тоновая студии звукозаписи', '0', 0, 0, '', 10, 0],
            [126, 1, 4, 512, 'Студия звукозаписи', '0', 0, 0, '', 10, 0],
            [127, 1, 10, 514, 'Мастерская', '0', 0, 0, '', 10, 0],
            [128, 1, 5, 516, 'Складское помещение', '0', 0, 0, '', 10, 0],
            [129, 1, 5, 517, 'Складское помещение', '0', 0, 0, '', 10, 0],
            [130, 1, 7, 0, 'Лестничные марши и пролеты 1-3 эт', '', 0, 0, '', 10, 0],
            [131, 1, 7, 23, 'ИЗО', '1', 0, 20, 'Холл', 10, 0],
            [132, 1, 4, 401, 'Помещение звукооператора', '4', 0, 2, '', 10, 0],

        ])->execute();

        $this->createIndex('building_id', '{{%auditory}}', 'building_id');
        $this->createIndex('cat_id', '{{%auditory}}', 'cat_id');
        $this->addForeignKey('auditory_ibfk_1', '{{%auditory}}', 'cat_id', '{{%auditory_cat}}', 'id', 'NO ACTION', 'NO ACTION');
        $this->addForeignKey('auditory_ibfk_2', '{{%auditory}}', 'building_id', '{{%auditory_building}}', 'id', 'NO ACTION', 'NO ACTION');
    }

    public function down()
    {
        $this->dropTable('{{%auditory}}');
        $this->dropTable('{{%auditory_building}}');
        $this->dropTable('{{%auditory_cat}}');
    }
}
