<?php

class m210301_150325_create_table_auditory extends \artsoft\db\BaseMigration
{
    public function up()
    {
        $tableOptions = null;

        $this->createTable('guide_auditory_cat', [
            'id' => $this->primaryKey() . ' constraint check_range check (id between 1000 and 9999)',
            'name' => $this->string(128)->notNull(),
            'description' => $this->string(512),
        ], $tableOptions);
        $this->addCommentOnTable('guide_auditory_cat','Категории аудиторий');
        $this->db->createCommand()->resetSequence('guide_auditory_cat', 1000)->execute();

        $this->db->createCommand()->batchInsert('guide_auditory_cat', ['name'], [
            ['Учебные аудитории'],
            ['Концертные залы'],
            ['Кабинеты'],
            ['Служебные помещения'],
            ['Складские помещения'],
            ['Подсобные помещения'],
            ['Коридоры и холлы'],
            ['Другие помещения'],
            ['Условные классы'],
            ['Технические помещения'],
        ])->execute();

        $this->createTable('guide_auditory_building', [
            'id' => $this->primaryKey() . ' constraint check_range check (id between 1000 and 9999)',
            'name' => $this->string(128)->notNull(),
            'slug' => $this->string(64)->notNull(),
            'address' => $this->string(128)->notNull(),
        ], $tableOptions);
        $this->addCommentOnTable('guide_auditory_building','Здания');
        $this->db->createCommand()->resetSequence('guide_auditory_building', 1000)->execute();

        $this->db->createCommand()->batchInsert('guide_auditory_building', ['name', 'slug', 'address'], [
            ['Основное здание', 'ОЗ', 'Митинская ул. д.47, кор.1'],
            ['Филиал', 'Ф', 'Пятницкое шоссе, д. 40'],
        ])->execute();

        $this->createTableWithHistory('auditory', [
            'id' => $this->primaryKey() . ' constraint check_range check (id between 1000 and 9999)',
            'building_id' => $this->integer()->notNull(),
            'cat_id' => $this->integer()->notNull(),
            'num' => $this->integer(3),
            'name' => $this->string(128),
            'floor' => $this->string(32),
            'area' => $this->float(),
            'capacity' => $this->integer(3),
            'description' => $this->string(),
            'status' => $this->integer()->notNull()->defaultValue(1),
            'study_flag' => $this->boolean()->defaultValue(false),
            'sort_order' => $this->integer()->notNull()->defaultValue(1),
            'created_at' => $this->integer()->notNull(),
            'created_by' => $this->integer(),
            'updated_at' => $this->integer()->notNull(),
            'updated_by' => $this->integer(),
            'version' => $this->bigInteger()->notNull()->defaultValue(0),
        ], $tableOptions);

        $this->addCommentOnTable('auditory','Аудитории');

        $this->db->createCommand()->batchInsert('auditory', ['id', 'sort_order', 'study_flag', 'building_id', 'cat_id', 'num', 'name',
            'floor', 'area', 'capacity', 'description', 'status', 'created_at', 'updated_at', 'created_by', 'updated_by'], [
            [1000, 1000, true, 1000, 1001, 302, 'Большой Зал', '3', 362, 283, '', 1, time(), time(), 10000, 10000],
            [1001, 1001, true, 1000, 1001, 103, 'Малый зал', '1', 93.8, 0, '', 1, time(), time(), 10000, 10000],
            [1002, 1002, true, 1000, 1000, 106, 'Класс композиции', '1', 32.9, 14, '', 1, time(), time(), 10000, 10000],
            [1003, 1003, true, 1000, 1000, 107, 'Класс скульптуры', '1', 31.9, 14, '', 1, time(), time(), 10000, 10000],
            [1004, 1004, true, 1000, 1000, 109, 'Класс живописи', '1', 42, 14, '', 1, time(), time(), 10000, 10000],
            [1005, 1005, true, 1000, 1000, 110, 'Класс живописи', '1', 35.8, 14, '', 1, time(), time(), 10000, 10000],
            [1006, 1006, true, 1000, 1000, 111, 'Класс рисунка', '1', 40.9, 14, '', 1, time(), time(), 10000, 10000],
            [1007, 1007, true, 1000, 1000, 114, 'Класс теоретических дисциплин', '1', 27.5, 14, '', 1, time(), time(), 10000, 10000],
            [1008, 1008, true, 1000, 1000, 115, 'Класс теоретических дисциплин', '1', 39.6, 14, '', 1, time(), time(), 10000, 10000],
            [1009, 1009, true, 1000, 1000, 116, 'Класс теоретических дисциплин', '1', 38.1, 14, '', 1, time(), time(), 10000, 10000],
            [1010, 1010, true, 1000, 1000, 117, 'Хоровой класс', '1', 50.3, 0, 'Музыкальный фольклор', 1, time(), time(), 10000, 10000],
            [1011, 1011, true, 1000, 1000, 119, 'Художественный фонд', '1', 13.2, 0, '', 1, time(), time(), 10000, 10000],
            [1012, 1012, true, 1000, 1000, 120, 'Класс теоретических дисциплин', '1', 25.5, 14, '', 1, time(), time(), 10000, 10000],
            [1013, 1013, true, 1000, 1000, 121, 'Класс теоретических дисциплин', '1', 35.9, 14, '', 1, time(), time(), 10000, 10000],
            [1014, 1014, true, 1000, 1000, 205, 'Кабинет заместителей директора', '2', 29.6, 0, '', 1, time(), time(), 10000, 10000],
            [1015, 1015, true, 1000, 1000, 206, 'Класс индивидуальных занятий', '2', 28.2, 0, 'Фортепиано', 1,time(), time(), 10000, 10000],
            [1016, 1016, true, 1000, 1000, 207, 'Класс индивидуальных занятий', '2', 26.7, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1017, 1017, true, 1000, 1000, 208, 'Класс индивидуальных занятий', '2', 28, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1018, 1018, true, 1000, 1000, 209, 'Класс индивидуальных занятий', '2', 27.9, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1019, 1019, true, 1000, 1000, 210, 'Класс индивидуальных занятий', '2', 16.5, 0, 'Арфа', 1, time(), time(), 10000, 10000],
            [1020, 1020, true, 1000, 1000, 211, 'Класс индивидуальных занятий', '2', 21.2, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1021, 1021, true, 1000, 1000, 212, 'Класс ансамбля', '2', 46.6, 0, 'Народные инструменты', 1, time(), time(), 10000, 10000],
            [1022, 1022, true, 1000, 1000, 213, 'Класс индивидуальных занятий', '2', 25.2, 0, 'Духовые инструменты', 1, time(), time(), 10000, 10000],
            [1023, 1023, true, 1000, 1000, 214, 'Класс индивидуальных занятий', '2', 25.7, 0, 'Духовые инструменты', 1, time(), time(), 10000, 10000],
            [1024, 1024, true, 1000, 1000, 215, 'Класс индивидуальных занятий', '2', 26.9, 0, 'Духовые инструменты', 1, time(), time(), 10000, 10000],
            [1025, 1025, true, 1000, 1000, 216, 'Класс ансамбля', '2', 30.2, 0, 'Струнные инструменты', 1, time(), time(), 10000, 10000],
            [1026, 1026, true, 1000, 1000, 217, 'Класс индивидуальных занятий', '2', 10.7, 0, '', 1, time(), time(), 10000, 10000],
            [1027, 1027, true, 1000, 1000, 218, 'Класс индивидуальных занятий', '2', 29.2, 0, '', 1, time(), time(), 10000, 10000],
            [1028, 1028, true, 1000, 1000, 219, 'Класс индивидуальных занятий', '2', 12, 0, '', 1, time(), time(), 10000, 10000],
            [1029, 1029, true, 1000, 1000, 220, 'Класс индивидуальных занятий', '2', 15.3, 0, '', 1, time(), time(), 10000, 10000],
            [1030, 1030, true, 1000, 1000, 221, 'Класс духового оркестра', '2', 64.9, 0, '', 1, time(), time(), 10000, 10000],
            [1031, 1031, true, 1000, 1000, 303, 'Хоровой класс', '3', 85, 0, '', 1, time(), time(), 10000, 10000],
            [1032, 1032, true, 1000, 1000, 304, 'Класс индивидуальных занятий', '3', 23.9, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1033, 1033, true, 1000, 1000, 305, 'Класс индивидуальных занятий', '3', 23.8, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1034, 1034, true, 1000, 1000, 306, 'Класс индивидуальных занятий', '3', 23.1, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1035, 1035, true, 1000, 1002, 312, 'Компьютерный класс', '3', 37.3, 14, '', 1, time(), time(), 10000, 10000],
            [1036, 1036, false, 1000, 1002, 313, 'Библиотека', '3', 19.6, 0, '', 1, time(), time(), 10000, 10000],
            [1037, 1037, true, 1000, 1000, 314, 'Класс индивидуальных занятий', '3', 15.8, 0, 'Вокал', 1, time(), time(), 10000, 10000],
            [1038, 1038, true, 1000, 1000, 317, 'Класс хореографии', '3', 85, 0, '', 1, time(), time(), 10000, 10000],
            [1039, 1039, true, 1000, 1000, 333, 'Класс индивидуальных занятий', '3', 20, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1040, 1040, true, 1000, 1000, 336, 'Класс хореографии', '3', 77.9, 0, '', 1, time(), time(), 10000, 10000],
            [1041, 1041, true, 1000, 1000, 346, 'Класс ударных инструментов', '3', 26.7, 0, '', 1, time(), time(), 10000, 10000],
            [1042, 1042, true, 1000, 1000, 347, 'Класс эстрадно-джазового оркестра', '3', 37.7, 0, '', 1, time(), time(), 10000, 10000],
            [1043, 1043, true, 1000, 1000, 350, 'Класс индивидуальных занятий', '3', 20, 0, '', 1, time(), time(), 10000, 10000],
            [1044, 1044, true, 1000, 1000, 351, 'Класс индивидуальных занятий', '3', 15.9, 0, 'Народные инструменты', 1, time(), time(), 10000, 10000],
            [1045, 1045, true, 1000, 1000, 355, 'Класс индивидуальных занятий', '3', 10, 0, '', 1, time(), time(), 10000, 10000],
            [1046, 1046, true, 1000, 1000, 356, 'Класс индивидуальных занятий', '3', 15, 0, 'Фортепиано', 1, time(), time(), 10000, 10000],
            [1047, 1047, true, 1000, 1000, 357, 'Класс индивидуальных занятий', '3', 12.1, 0, '', 1, time(), time(), 10000, 10000],
            [1048, 1048, true, 1000, 1000, 358, 'Класс индивидуальных занятий', '3', 11.3, 0, '', 1, time(), time(), 10000, 10000],
            [1049, 1049, true, 1000, 1006, 102, 'Вестибюль 1-го этажа', '1', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1050, 1050, true, 1000, 1006, 200, 'Вестибюль 2-го этажа', '2', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1051, 1051, true, 1000, 1006, 301, 'Вестибюль 3-го этажа', '3', 0, 0, 'Музей', 1, time(), time(), 10000, 10000],
            [1052, 1052, true, 1000, 1006, 141, 'Холл 1-го этажа', '1', 0, 0, 'Для выставок ИЗО', 1, time(), time(), 10000, 10000],
            [1053, 1053, true, 1000, 1006, 241, 'Холл 2-го этажа', '2', 0, 0, 'Для выставок ИЗО', 1, time(), time(), 10000, 10000],
            [1054, 1054, true, 1000, 1006, 332, 'Холл 3-го этажа', '3', 0, 0, 'Для высавок ИЗО', 1, time(), time(), 10000, 10000],
            [1055, 1055, true, 1000, 1006, 0, 'Лестничные марши и пролеты 1-3 эт', '', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1056, 1056, true, 1000, 1006, 23, 'ИЗО', '1', 0, 20, 'Холл', 1, time(), time(), 10000, 10000],
            [1057, 1057, true, 1000, 1008, 0, 'По классам', '1', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1058, 1058, true, 1001, 1000, 1, 'Класс архитектуры', '1', 20.3, 10, '', 1, time(), time(), 10000, 10000],
            [1059, 1059, true, 1001, 1000, 2, 'Класс развития', '1', 20.3, 6, 'Мандариновое детство', 1, time(), time(), 10000, 10000],
            [1060, 1060, true, 1001, 1000, 3, 'Класс развития', '1', 21.2, 8, 'Мандариновое детство', 1, time(), time(), 10000, 10000],
            [1061, 1061, true, 1001, 1000, 4, 'Класс развития', '1', 14.8, 7, 'Мандариновое детство', 1, time(), time(), 10000, 10000],
            [1062, 1062, false, 1001, 1002, 5, 'Администраторы', '1', 12.2, 0, '', 1, time(), time(), 10000, 10000],
            [1063, 1063, false, 1001, 1002, 6, 'Учительская', '1', 12.3, 0, '', 1, time(), time(), 10000, 10000],
            [1064, 1064, false, 1001, 1002, 7, 'Лаборатория', '1', 9.7, 0, 'Художественная керамика', 1, time(), time(), 10000, 10000],
            [1065, 1065, true, 1001, 1000, 8, 'ИЗО', '1', 21.1, 12, '', 1, time(), time(), 10000, 10000],
            [1066, 1066, true, 1001, 1000, 9, 'ИЗО', '1', 14.8, 8, '', 1, time(), time(), 10000, 10000],
            [1067, 1067, true, 1001, 1000, 10, 'Класс скульптуры', '1', 20, 10, 'Художественная керамика', 1, time(), time(), 10000, 10000],
            [1068, 1068, true, 1001, 1000, 11, 'ИЗО', '1', 20.1, 12, '', 1, time(), time(), 10000, 10000],
            [1069, 1069, true, 1001, 1000, 12, 'ИЗО', '1', 19.9, 12, '', 1, time(), time(), 10000, 10000],
            [1070, 1070, false, 1000, 1006, 101, 'Помещение охраны', '1', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1071, 1071, false, 1000, 1002, 104, 'Кабинет зам. директора по АХР', '1', 23, 0, '', 1, time(), time(), 10000, 10000],
            [1072, 1072, true, 1000, 1002, 105, 'Кабинет истории искусств', '1', 36, 0, '', 1, time(), time(), 10000, 10000],
            [1073, 1073, false, 1000, 1007, 112, 'Буфет', '1', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1074, 1074, false, 1000, 1002, 122, 'Кабинет зам. директора по кадрам', '1', 16, 0, '', 1, time(), time(), 10000, 10000],
            [1075, 1075, true, 1000, 1002, 201, 'Кабинет директора', '2', 29, 0, '', 1, time(), time(), 10000, 10000],
            [1076, 1076, false, 1000, 1002, 202, 'Кабинет зам. директора по оргвопросам', '2', 12, 0, '', 1, time(), time(), 10000, 10000],
            [1077, 1077, false, 1000, 1002, 203, 'Кабинет главного бухгалтера', '2', 16, 0, '', 1, time(), time(), 10000, 10000],
            [1078, 1078, false, 1000, 1002, 204, 'Бухгалтерия', '2', 37, 0, '', 1, time(), time(), 10000, 10000],
            [1079, 1079, false, 1000, 1002, 222, 'Инженерная служба', '2', 19.3, 0, '', 1, time(), time(), 10000, 10000],
            [1080, 1080, false, 1000, 1003, 232, 'Серверная', '2', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1081, 1081, false, 1000, 1003, 401, 'Помещение множительной техники', '4', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1082, 1082, false, 1000, 1003, 402, 'Помещение звукооператора', '4', 0, 2, '', 1, time(), time(), 10000, 10000],
            [1083, 1083, false, 1000, 1001, 501, 'Тренажерный зал', '0', 81.1, 0, '', 1, time(), time(), 10000, 10000],
            [1084, 1084, false, 1000, 1002, 502, 'Тренерская', '0', 6.1, 0, '', 1, time(), time(), 10000, 10000],
            [1085, 1085, false, 1000, 1002, 503, 'Массажный кабинет', '0', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1086, 1086, true, 1000, 1003, 511, 'Тоновая студии звукозаписи', '0', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1087, 1087, true, 1000, 1003, 512, 'Студия звукозаписи', '0', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1088, 1088, false, 1000, 1002, 513, 'Кабинет', '0', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1089, 1089, false, 1000, 1009, 514, 'Мастерская', '0', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1090, 1090, false, 1000, 1009, 515, 'Мастерская', '0', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1091, 1091, false, 1000, 1004, 516, 'Складское помещение', '0', 0, 0, '', 1, time(), time(), 10000, 10000],
            [1092, 1092, false, 1000, 1004, 517, 'Складское помещение', '0', 0, 0, '', 1, time(), time(), 10000, 10000],

        ])->execute();

        $this->db->createCommand()->resetSequence('auditory', 1093)->execute();

        $this->createIndex('building_id', 'auditory', 'building_id');
        $this->createIndex('cat_id', 'auditory', 'cat_id');
        $this->addForeignKey('auditory_ibfk_1', 'auditory', 'cat_id', 'guide_auditory_cat', 'id', 'NO ACTION', 'NO ACTION');
        $this->addForeignKey('auditory_ibfk_2', 'auditory', 'building_id', 'guide_auditory_building', 'id', 'NO ACTION', 'NO ACTION');
    }

    public function down()
    {
        $this->dropForeignKey('auditory_ibfk_1', 'auditory');
        $this->dropForeignKey('auditory_ibfk_2', 'auditory');
        $this->dropTableWithHistory('auditory');
        $this->dropTable('guide_auditory_building');
        $this->dropTable('guide_auditory_cat');
    }
}
