<?php

use yii\db\Migration;

class m210301_151057_create_table_subject extends \artsoft\db\BaseMigration
{
    public function up()
    {
        $tableOptions = null;
        if ($this->db->driverName === 'mysql') {
            $tableOptions = 'CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci ENGINE=InnoDB';
        }

          $this->createTable('guide_subject_category', [
            'id' => $this->primaryKey(),
            'name' => $this->string(127),
            'slug' => $this->string(64)->notNull(),
            'status' => $this->tinyInteger(2)->unsigned()->notNull(),
            'sort_order' => $this->tinyInteger(2)->unsigned()->notNull(),
        ], $tableOptions);

        $this->db->createCommand()->batchInsert('guide_subject_category', ['id', 'name', 'slug', 'sort_order', 'status'], [
            [1, 'Специальность', 'Спец.', 1, 1],
            [2, 'Музыкальный инструмент', 'Инстр', 2, 1],
            [3, 'Дисциплины отдела', 'Дис.отд.', 3, 1],
            [4, 'Общие дисциплины', 'Общ.', 4, 1],
            [5, 'Предмет по выбору', 'П/в.', 5, 1],
            [6, 'Коллективное музицирование', 'Кол.муз.', 6, 1],
            [7, 'Сводные репетиции', 'Св.реп', 7, 1],
        ])->execute();

        $this->createTable('guide_subject_vid', [
            'id' => $this->primaryKey(),
            'name' => $this->string(64)->notNull(),
            'slug' => $this->string(32)->notNull(),
            'qty_min' => $this->smallInteger(3)->unsigned()->notNull(),
            'qty_max' => $this->smallInteger(3)->unsigned()->notNull(),
            'info' => $this->text()->notNull(),
            'status' => $this->tinyInteger(1)->notNull(),
        ], $tableOptions);

        $this->db->createCommand()->batchInsert('guide_subject_vid', ['name', 'slug','qty_min','qty_max','info','status'], [
            ['Индивидуальные', 'Инд.', 0, 1,'',1],
            ['Мелкогрупповые', 'Мелк-гр.', 0, 1,'',1],
            ['Групповые', 'Гр.', 0, 1,'',1],
        ])->execute();


        $this->createTable('guide_subject_type', [
            'id' => $this->primaryKey(),
            'name' => $this->string(127)->notNull(),
            'slug' => $this->string(64)->notNull(),
            'status' => $this->tinyInteger(1)->unsigned()->notNull(),
        ], $tableOptions);

        $this->db->createCommand()->batchInsert('guide_subject_type', ['name', 'slug', 'status'], [
            ['Бюджет', 'Бюд.', 1],
            ['Хозрасчет', 'х/р.', 1],
        ])->execute();

        $this->createTableWithHistory('subject', [
            'id' => $this->primaryKey() . ' constraint check_range check (id between 1000 and 9999)',
            'name' => $this->string(127),
            'slug' => $this->string(32),
            'type_list' => $this->string(1024),
            'vid_list' => $this->string(1024),
            'category_list' => $this->string(1024),
            'created_at' => $this->integer()->notNull(),
            'created_by' => $this->integer(),
            'updated_at' => $this->integer()->notNull(),
            'updated_by' => $this->integer(),
            'status' => $this->smallInteger()->notNull()->defaultValue(1),
            'version' => $this->bigInteger()->notNull()->defaultValue(0),
        ], $tableOptions);

        $this->db->createCommand()->resetSequence('subject', 1000)->execute();
        $this->db->createCommand()->batchInsert('subject', ['name', 'slug', 'status', 'created_at', 'updated_at', 'created_by', 'updated_by'], [
            ['Академический вокал', 'Акад.вок.', 1, time(), time(), 1000, 1000],
            ['Аккордеон', 'Акк-н', 1, time(), time(), 1000, 1000],
            ['Акробатика', 'Акробатика', 1, time(), time(), 1000, 1000],
            ['Актерское мастерство', 'Акт.маст', 1, time(), time(), 1000, 1000],
            ['Альт', 'Альт', 1, time(), time(), 1000, 1000],
            ['Ансамбль духовых инструментов', 'Анс.дух.инстр.', 1, time(), time(), 1000, 1000],
            ['Ансамбль народных инструментов', 'Анс.нар.инстр.', 1, time(), time(), 1000, 1000],
            ['Ансамбль', 'Анс.', 1, time(), time(), 1000, 1000],
            ['Арфа', 'Арфа', 1, time(), time(), 1000, 1000],
            ['Архитектурное творчество', 'Арх.тв.', 1, time(), time(), 1000, 1000],
            ['Архитектурные стили', 'Арх.ст.', 1, time(), time(), 1000, 1000],
            ['Архитектурный рисунок', 'Арх.рис.', 1, time(), time(), 1000, 1000],
            ['Балалайка', 'Бал', 1, time(), time(), 1000, 1000],
            ['Баллетная гимнастика', 'Бал.гимн', 1, time(), time(), 1000, 1000],
            ['Бально-спортивный танец', 'Бал-спорт.тан', 1, time(), time(), 1000, 1000],
            ['Баритон', 'Барит', 1, time(), time(), 1000, 1000],
            ['Бас гитара', 'Б.гит', 1, time(), time(), 1000, 1000],
            ['Баян', 'Баян', 1, time(), time(), 1000, 1000],
            ['Беседы об искусстве', 'Беседы об иск-ве', 1, time(), time(), 1000, 1000],
            ['Беседы по хореографическому искусству', 'Беседы по хореогр-му иск-ву', 1, time(), time(), 1000, 1000],
            ['Блок флейта', 'Бл.фл', 1, time(), time(), 1000, 1000],
            ['Брейк-данс', 'Брейк-данс', 1, time(), time(), 1000, 1000],
            ['Валторна', 'Валт', 1, time(), time(), 1000, 1000],
            ['Веселая арифметика', 'Арифм.', 1, time(), time(), 1000, 1000],
            ['Веселые нотки', 'Вес.нотки', 1, time(), time(), 1000, 1000],
            ['Виолончель', 'Виол', 1, time(), time(), 1000, 1000],
            ['Вокал', 'Вок', 1, time(), time(), 1000, 1000],
            ['Вокально-хоровой ансамбль', 'Вок-хор.анс.', 1, time(), time(), 1000, 1000],
            ['Вокальный ансамбль', 'Вок.анс.', 1, time(), time(), 1000, 1000],
            ['Вокальный эстрадно-джазовый ансамбль', 'Вок.анс.', 1, time(), time(), 1000, 1000],
            ['Гармонь', 'Гарм', 1, time(), time(), 1000, 1000],
            ['Гимнастика', 'Гим-ка', 1, time(), time(), 1000, 1000],
            ['Гитара', 'Гитар', 1, time(), time(), 1000, 1000],
            ['Графика', 'Граф.', 1, time(), time(), 1000, 1000],
            ['Гусли', 'Гусли', 1, time(), time(), 1000, 1000],
            ['Декоративно-прикладное искусство', 'ДПИ', 1, time(), time(), 1000, 1000],
            ['Декорирование', 'Декор', 1, time(), time(), 1000, 1000],
            ['Детские массовые танцы', 'ДМТ', 1, time(), time(), 1000, 1000],
            ['Джазовый ансамбль', 'джаз.анс.', 1, time(), time(), 1000, 1000],
            ['Домра', 'Домр', 1, time(), time(), 1000, 1000],
            ['Живопись', 'Жив-сь.', 1, time(), time(), 1000, 1000],
            ['Импровизация', 'Импр.', 1, time(), time(), 1000, 1000],
            ['Историко-бытовой и бальный танец', 'Бальн.тан.', 1, time(), time(), 1000, 1000],
            ['История архитектуры', 'Ист.арх.', 1, time(), time(), 1000, 1000],
            ['История джаза', 'Ист.дж.', 1, time(), time(), 1000, 1000],
            ['История изобразительного искусства', 'Ист.ИЗО', 1, time(), time(), 1000, 1000],
            ['История искусств', 'Ист.иск.', 1, time(), time(), 1000, 1000],
            ['Кларнет', 'Клар', 1, time(), time(), 1000, 1000],
            ['Классический станок', 'Класс.ст.', 1, time(), time(), 1000, 1000],
            ['Классический танец', 'Класс.танец', 1, time(), time(), 1000, 1000],
            ['Классический экзерсис', 'Кл.Экз', 1, time(), time(), 1000, 1000],
            ['Композиционная постановка танца', 'КПТ', 1, time(), time(), 1000, 1000],
            ['Композиция (станковая, прикладная)', 'Комп.', 1, time(), time(), 1000, 1000],
            ['Композиция', 'Комп', 1, time(), time(), 1000, 1000],
            ['Латина соло', 'Латина соло', 1, time(), time(), 1000, 1000],
            ['Лепка', 'Лепка', 1, time(), time(), 1000, 1000],
            ['Логопедия', 'Лого', 1, time(), time(), 1000, 1000],
            ['Логоритмика', 'Логоритмика', 1, time(), time(), 1000, 1000],
            ['Макетирование', 'Макет', 1, time(), time(), 1000, 1000],
            ['Мастерство актера', 'Маст.акт.', 1, time(), time(), 1000, 1000],
            ['Материаловедение', 'Мат.вед.', 1, time(), time(), 1000, 1000],
            ['Музыкальная грамота', 'Муз.гр.', 1, time(), time(), 1000, 1000],
            ['Музыкальная информатика', 'Муз.инф.', 1, time(), time(), 1000, 1000],
            ['Музыкальная литература и слушание музыки', 'Муз.лит.сл.муз.', 1, time(), time(), 1000, 1000],
            ['Музыкальная литература', 'Муз.лит.', 1, time(), time(), 1000, 1000],
            ['Народная хореография', 'Нар.хореогр.', 1, time(), time(), 1000, 1000],
            ['Народно-сценический танец', 'Нар-сц.тан.', 1, time(), time(), 1000, 1000],
            ['Народное творчество', 'Нар.тв-во', 1, time(), time(), 1000, 1000],
            ['Народный оркестр', 'Нар.орк.', 1, time(), time(), 1000, 1000],
            ['Народный характерный танец', 'НХТ', 1, time(), time(), 1000, 1000],
            ['Народный хор', 'Нар.хор', 1, time(), time(), 1000, 1000],
            ['Натурный рисунок', 'Нат.рис.', 1, time(), time(), 1000, 1000],
            ['Орган', 'Орган', 1, time(), time(), 1000, 1000],
            ['Оркестр аккордеонистов', 'Орк. аккорд.', 1, time(), time(), 1000, 1000],
            ['Оркестр гитаристов', 'орк.гит.', 1, time(), time(), 1000, 1000],
            ['Оркестр духовых инструментов', 'дух.орк.', 1, time(), time(), 1000, 1000],
            ['Основы ИЗО', 'Осн.ИЗО', 1, time(), time(), 1000, 1000],
            ['Основы актерского мастерства', 'Осн.акт.маст.', 1, time(), time(), 1000, 1000],
            ['Основы бального танца', 'Основы бальн.танца', 1, time(), time(), 1000, 1000],
            ['Основы графики', 'Осн.граф.', 1, time(), time(), 1000, 1000],
            ['Основы дирижирования', 'Дир.', 1, time(), time(), 1000, 1000],
            ['Основы изобразительного искусства', 'Осн.ИЗО', 1, time(), time(), 1000, 1000],
            ['Основы изобразительной грамоты общ', 'ОИГ общ', 1, time(), time(), 1000, 1000],
            ['Основы изобразительной грамоты', 'ОИГ', 1, time(), time(), 1000, 1000],
            ['Основы импровизации', 'Импр-я', 1, time(), time(), 1000, 1000],
            ['Основы народного танца', 'ОНТ', 1, time(), time(), 1000, 1000],
            ['Основы русского народного танца', 'ОРНТ', 1, time(), time(), 1000, 1000],
            ['Основы сценического мастерства', 'Основы сц.маст-ва', 1, time(), time(), 1000, 1000],
            ['Основы хореографии', 'Осн.хореогр.', 1, time(), time(), 1000, 1000],
            ['Основы эстрадного танца', 'Основы эстр.танца', 1, time(), time(), 1000, 1000],
            ['Партерная гимнастика', 'Парт.гим-ка', 1, time(), time(), 1000, 1000],
            ['Пластика', 'Пластика', 1, time(), time(), 1000, 1000],
            ['Пластическая, конструктивная лепка', 'ПКЛ', 1, time(), time(), 1000, 1000],
            ['Пленэр', 'Пленэр', 1, time(), time(), 1000, 1000],
            ['Проект', 'Проект', 1, time(), time(), 1000, 1000],
            ['Развитие речи', 'Раз.реч.', 1, time(), time(), 1000, 1000],
            ['Разминка', 'Разминка', 1, time(), time(), 1000, 1000],
            ['Растяжка', 'Растяжка', 1, time(), time(), 1000, 1000],
            ['Рисунок', 'Рис.', 1, time(), time(), 1000, 1000],
            ['Ритм гитара', 'Р.гит', 1, time(), time(), 1000, 1000],
            ['Ритмика и танец', 'Ритм.тан', 1, time(), time(), 1000, 1000],
            ['Ритмика', 'Рит.', 1, time(), time(), 1000, 1000],
            ['Ритмическое сольфеджио', 'Ритм.сольф.', 1, time(), time(), 1000, 1000],
            ['Саксофон', 'Сакс', 1, time(), time(), 1000, 1000],
            ['Сводная репетиция ОРНТ', 'Св.реп.орнт', 1, time(), time(), 1000, 1000],
            ['Сводная репетиция фольклорного ансамбля', 'Св.реп.фольк.анс', 1, time(), time(), 1000, 1000],
            ['Сводная репетиция хора', 'Св.реп.хор.', 1, time(), time(), 1000, 1000],
            ['Сводный струнный ансамбль', 'Св.стр.анс.', 1, time(), time(), 1000, 1000],
            ['Скетчинг', 'Скетч.', 1, time(), time(), 1000, 1000],
            ['Скрипка', 'Скр', 1, time(), time(), 1000, 1000],
            ['Скульптура', 'Скульпт.', 1, time(), time(), 1000, 1000],
            ['Слушание музыки и музыкальная грамота', 'Сл.муз.и муз.гр.', 1, time(), time(), 1000, 1000],
            ['Слушание музыки', 'Сл.муз.', 1, time(), time(), 1000, 1000],
            ['Современная хореография', 'Совр.хореогр.', 1, time(), time(), 1000, 1000],
            ['Современный танец', 'Совр.танец', 1, time(), time(), 1000, 1000],
            ['Сольфеджио', 'Сольф.', 1, time(), time(), 1000, 1000],
            ['Сочинение и аккомпанемент', 'Соч.акк.', 1, time(), time(), 1000, 1000],
            ['Сочинение и композиция', 'Соч.и комп.', 1, time(), time(), 1000, 1000],
            ['Струнный ансамбль', 'Стр.анс', 1, time(), time(), 1000, 1000],
            ['Сцена', 'Сцена', 1, time(), time(), 1000, 1000],
            ['Сценическая речь', 'Сц.речь', 1, time(), time(), 1000, 1000],
            ['Сценическое движение', 'Сц.дв.', 1, time(), time(), 1000, 1000],
            ['Сценическое мастерство', 'Сц.М', 1, time(), time(), 1000, 1000],
            ['Танцевальная практика', 'Танц.практ.', 1, time(), time(), 1000, 1000],
            ['Тенор', 'Тенор', 1, time(), time(), 1000, 1000],
            ['Теория и история джазовой музыки', 'ТИДМ', 1, time(), time(), 1000, 1000],
            ['Теория музыки', 'т/м', 1, time(), time(), 1000, 1000],
            ['Тромбон', 'Тром', 1, time(), time(), 1000, 1000],
            ['Труба', 'Труб', 1, time(), time(), 1000, 1000],
            ['Туба', 'Туба', 1, time(), time(), 1000, 1000],
            ['Ударные', 'Удар', 1, time(), time(), 1000, 1000],
            ['Флейта', 'Фле', 1, time(), time(), 1000, 1000],
            ['Фольклорный ансамбль', 'Ф.анс.', 1, time(), time(), 1000, 1000],
            ['Формовка', 'Форм.', 1, time(), time(), 1000, 1000],
            ['Формообразование', 'ФО', 1, time(), time(), 1000, 1000],
            ['Фортепиано', 'Ф-но', 1, time(), time(), 1000, 1000],
            ['Характерный танец', 'Характ.тан.', 1, time(), time(), 1000, 1000],
            ['Хор спец.гр.', 'Хор спец.гр.', 1, time(), time(), 1000, 1000],
            ['Хор', 'Хор', 1, time(), time(), 1000, 1000],
            ['Хоровой класс', 'Хор.класс.', 1, time(), time(), 1000, 1000],
            ['Художественная керамика', 'Худ.Кер.', 1, time(), time(), 1000, 1000],
            ['Художественное слово', 'Худ.сл.', 1, time(), time(), 1000, 1000],
            ['Черчение', 'Черч.', 1, time(), time(), 1000, 1000],
            ['Чтение с листа', 'Чт.лист', 1, time(), time(), 1000, 1000],
            ['Чтение хоровых партитур', 'Чт.хор.п.', 1, time(), time(), 1000, 1000],
            ['Чудеса в ладошках', 'ЧВЛ', 1, time(), time(), 1000, 1000],
            ['Шликерное литьё', 'Литьё', 1, time(), time(), 1000, 1000],
            ['Электронно-компьютерное музицирование', 'ЭКМ', 1, time(), time(), 1000, 1000],
            ['Эстрадно-джазовое пение', 'Эст.дж.пен.', 1, time(), time(), 1000, 1000],
            ['Эстрадно-джазовый оркестр', 'Джаз.орк.', 1, time(), time(), 1000, 1000],
            ['Эстрадный вокал', 'Эстр.вок', 1, time(), time(), 1000, 1000],
            ['Эстрадный танец', 'эстр.тан.', 1, time(), time(), 1000, 1000],
            ['Body Ballet', 'Body Ballet', 1, time(), time(), 1000, 1000],
            ['"Всезнайки" - класс раннего развития', '"Всезнайки"', 1, time(), time(), 1000, 1000],
            ['"Знайки" - класс раннего развития', '"Знайки"', 1, time(), time(), 1000, 1000],
            ['"Познайки"- класс раннего развития', '"Познайки"', 1, time(), time(), 1000, 1000],
            ['"Почемучки" - класс раннего развития', '"Почемучки"', 1, time(), time(), 1000, 1000],
        ])->execute();
    }

    public function down()
    {
        $this->dropTableWithHistory('subject');
        $this->dropTable('guide_subject_type');
        $this->dropTable('guide_subject_vid');
        $this->dropTable('subject_category');
        $this->dropTable('subject_department');
        $this->dropTable('guide_subject_vid');
        $this->dropTable('guide_subject_category');
    }
}
