<?php

class m210301_150325_create_table_auditory extends \artsoft\db\BaseMigration
{
    public function up()
    {
        $tableOptions = null;

        $this->createTable('guide_auditory_cat', [
            'id' => $this->primaryKey() . ' constraint check_range check (id between 1000 and 9999)',
            'name' => $this->string(128)->notNull(),
            'description' => $this->string(256)->notNull(),
            'study_flag' => $this->tinyInteger(1)->notNull()->defaultValue('0'),
        ], $tableOptions);
        $this->addCommentOnTable('guide_auditory_cat','Категории аудиторий');
        $this->db->createCommand()->resetSequence('guide_auditory_cat', 1000)->execute();

        $this->db->createCommand()->batchInsert('guide_auditory_cat', ['name', 'description','study_flag'], [
            ['Аудитории и классы', '', 1],
            ['Залы', '', 1],
            ['Кабинеты', '', 1],
            ['Служебные помещения', '', 0],
            ['Складские помещения', '', 0],
            ['Подсобные помещения', '', 0],
            ['Коридоры и холлы', '', 1],
            ['Другие помещения', '', 0],
            ['Условные классы', '', 1],
            ['Технические помещения', '', 0],
        ])->execute();

        $this->createTable('guide_auditory_building', [
            'id' => $this->primaryKey() . ' constraint check_range check (id between 1000 and 9999)',
            'name' => $this->string(128)->notNull(),
            'slug' => $this->string(64)->notNull(),
            'address' => $this->string()->notNull(),
        ], $tableOptions);
        $this->addCommentOnTable('guide_auditory_building','Здания');
        $this->db->createCommand()->resetSequence('guide_auditory_building', 1000)->execute();

        $this->db->createCommand()->batchInsert('guide_auditory_building', ['name', 'slug', 'address'], [
            ['Основное здание', 'ОЗ', 'Митинская ул. д.47, кор.1'],
            ['Филиал', 'Ф', 'Пятницкое шоссе, д. 40'],
        ])->execute();

        $this->createTableWithHistory('auditory', [
            'id' => $this->primaryKey() . ' constraint check_range check (id between 1000 and 9999)',
            'building_id' => $this->integer()->notNull(),
            'cat_id' => $this->integer()->unsigned(),
            'num' => $this->integer(3),
            'name' => $this->string(128),
            'floor' => $this->string(32)->notNull(),
            'area' => $this->float()->notNull(),
            'capacity' => $this->integer(3)->notNull(),
            'description' => $this->string(),
            'status' => $this->integer()->notNull()->defaultValue('10'),
            'sort_order' => $this->integer()->notNull(),
            'created_at' => $this->integer()->notNull(),
            'created_by' => $this->integer(),
            'updated_at' => $this->integer()->notNull(),
            'updated_by' => $this->integer(),
            'version' => $this->bigInteger()->notNull()->defaultValue(0),
        ], $tableOptions);

        $this->db->createCommand()->resetSequence('auditory', 1000)->execute();
        $this->addCommentOnTable('auditory','Аудитории');

        $this->db->createCommand()->batchInsert('auditory', ['building_id', 'cat_id', 'num', 'name',
            'floor', 'area', 'capacity', 'description', 'status', 'sort_order', 'created_at', 'updated_at', 'created_by', 'updated_by'], [
            [1000, 1008, 0, 'По классам', '1', 0, 0, '', 10, 43, time(), time(), 1000, 1000],
            [1001, 1000, 1, 'Класс архитектуры', '1', 20.3, 10, '', 10, 37, time(), time(), 1000, 1000],
            [1001, 1000, 10, 'Класс скульптуры', '1', 20, 10, 'Художественная керамика', 10, 36, time(), time(), 1000, 1000],
            [1001, 1000, 11, 'ИЗО', '1', 20.1, 12, '', 10, 40, time(), time(), 1000, 1000],
            [1001, 1000, 12, 'ИЗО', '1', 19.9, 12, '', 10, 38, time(), time(), 1000, 1000],
            [1001, 1000, 2, 'Класс развития', '1', 20.3, 6, 'Мандариновое детство', 10, 39, time(), time(), 1000, 1000],
            [1001, 1000, 3, 'Класс развития', '1', 21.2, 8, 'Мандариновое детство', 10, 42, time(), time(), 1000, 1000],
            [1001, 1000, 4, 'Класс развития', '1', 14.8, 7, 'Мандариновое детство', 10, 43, time(), time(), 1000, 1000],
            [1001, 1002, 5, 'Администраторы', '1', 12.2, 0, '', 10, 41, time(), time(), 1000, 1000],
            [1001, 1002, 6, 'Учительская', '1', 12.3, 0, '', 10, 45, time(), time(), 1000, 1000],
            [1001, 1002, 7, 'Лаборатория', '1', 9.7, 0, 'Художественная керамика', 10, 44, time(), time(), 1000, 1000],
            [1001, 1000, 8, 'ИЗО', '1', 21.1, 12, '', 10, 47, time(), time(), 1000, 1000],
            [1001, 1000, 1008, 'ИЗО', '1', 14.8, 8, '', 10, 56, time(), time(), 1000, 1000],
            [1000, 1000, 106, 'Класс композиции', '1', 32.9, 14, '', 10, 53, time(), time(), 1000, 1000],
            [1000, 1000, 107, 'Класс скульптуры', '1', 31.9, 14, '', 10, 52, time(), time(), 1000, 1000],
            [1000, 1000, 109, 'Класс живописи', '1', 42, 14, '', 10, 65, time(), time(), 1000, 1000],
            [1000, 1000, 110, 'Класс живописи', '1', 35.8, 14, '', 10, 55, time(), time(), 1000, 1000],
            [1000, 1000, 111, 'Класс рисунка', '1', 40.9, 14, '', 10, 46, time(), time(), 1000, 1000],
            [1000, 1000, 114, 'Класс теоретических дисциплин', '1', 27.5, 14, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 115, 'Класс теоретических дисциплин', '1', 39.6, 14, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 116, 'Класс теоретических дисциплин', '1', 38.1, 14, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 117, 'Хоровой класс', '1', 50.3, 0, 'Музыкальный фольклор', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 119, 'Художественный фонд', '1', 13.2, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 120, 'Класс теоретических дисциплин', '1', 25.5, 14, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 121, 'Класс теоретических дисциплин', '1', 35.9, 14, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1001, 103, 'Малый зал', '1', 93.8, 0, '', 10, 105, time(), time(), 1000, 1000],
            [1000, 1002, 201, 'Кабинет директора', '2', 29, 0, '', 10, 67, time(), time(), 1000, 1000],
            [1000, 1000, 205, 'Класс индивидуальных занятий', '2', 29.6, 0, '', 10, 54, time(), time(), 1000, 1000],
            [1000, 1000, 206, 'Класс индивидуальных занятий', '2', 28.2, 0, 'Фортепиано', 10, 66, time(), time(), 1000, 1000],
            [1000, 1000, 207, 'Класс индивидуальных занятий', '2', 26.7, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 208, 'Класс индивидуальных занятий', '2', 28, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 209, 'Класс индивидуальных занятий', '2', 27.9, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 210, 'Класс индивидуальных занятий', '2', 16.5, 0, 'Арфа', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 211, 'Класс индивидуальных занятий', '2', 21.2, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 212, 'Класс ансамбля', '2', 46.6, 0, 'Народные инструменты', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 213, 'Класс индивидуальных занятий', '2', 25.2, 0, 'Духовые инструменты', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 214, 'Класс индивидуальных занятий', '2', 25.7, 0, 'Духовые инструменты', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 215, 'Класс индивидуальных занятий', '2', 26.9, 0, 'Духовые инструменты', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 216, 'Класс ансамбля', '2', 30.2, 0, 'Струнные инструменты', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 217, 'Класс индивидуальных занятий', '2', 10.7, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 220, 'Класс индивидуальных занятий', '2', 15.3, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 219, 'Класс индивидуальных занятий', '2', 12, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 218, 'Класс индивидуальных занятий', '2', 29.2, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 221, 'Класс духового оркестра', '2', 64.9, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 222, 'Инженерная служба', '2', 19.3, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 104, 'Кабинет зам. директора по АХР', '1', 23, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 105, 'Кабинет зам. директора', '1', 36, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 122, 'Кабинет зам. директора по кадрам', '1', 16, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 202, 'Кабинет зам. директора по оргвопросам', '2', 12, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 203, 'Кабинет главного бухгалтера', '2', 16, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 204, 'Бухгалтерия', '2', 37, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1001, 302, 'Большой Зал', '3', 362, 283, '', 10, 168, time(), time(), 1000, 1000],
            [1000, 1000, 303, 'Хоровой класс', '3', 85, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 304, 'Класс индивидуальных занятий', '3', 23.9, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 305, 'Класс индивидуальных занятий', '3', 23.8, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 306, 'Класс индивидуальных занятий', '3', 23.1, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 312, 'Компьютерный класс', '3', 37.3, 14, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 313, 'Библиотека', '3', 19.6, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 314, 'Класс индивидуальных занятий', '3', 15.8, 0, 'Вокал', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 317, 'Класс хореографии', '3', 85, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 333, 'Класс индивидуальных занятий', '3', 20, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 336, 'Класс хореографии', '3', 77.9, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 350, 'Класс индивидуальных занятий', '3', 20, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 351, 'Класс индивидуальных занятий', '3', 15.9, 0, 'Народные инструменты', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 358, 'Класс индивидуальных занятий', '3', 11.3, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 357, 'Класс индивидуальных занятий', '3', 12.1, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 356, 'Класс индивидуальных занятий', '3', 15, 0, 'Фортепиано', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 355, 'Класс индивидуальных занятий', '3', 10, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 347, 'Класс эстрадно-джазового оркестра', '3', 37.7, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1000, 346, 'Класс ударных инструментов', '3', 26.7, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1003, 401, 'Помещение множительной техники', '4', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1003, 232, 'Серверная', '2', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 102, 'Вестибюль 1-го этажа', '1', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 101, 'Помещение охраны', '1', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 200, 'Вестибюль 2-го этажа', '2', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 301, 'Вестибюль 3-го этажа', '3', 0, 0, 'Музей', 10, 0, time(), time(), 1000, 1000],
            [1000, 1009, 515, 'Мастерская', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1007, 112, 'Буфет', '1', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 141, 'Холл 1-го этажа', '1', 0, 0, 'Для выставок ИЗО', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 241, 'Холл 2-го этажа', '2', 0, 0, 'Для выставок ИЗО', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 332, 'Холл 3-го этажа', '3', 0, 0, 'Для высавок ИЗО', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 503, 'Массажный кабинет', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1001, 501, 'Тренажерный зал', '0', 81.1, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 502, 'Тренерская', '0', 6.1, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1002, 513, 'Кабинет', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1003, 511, 'Тоновая студии звукозаписи', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1003, 512, 'Студия звукозаписи', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1009, 514, 'Мастерская', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1004, 516, 'Складское помещение', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1004, 517, 'Складское помещение', '0', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 0, 'Лестничные марши и пролеты 1-3 эт', '', 0, 0, '', 10, 0, time(), time(), 1000, 1000],
            [1000, 1006, 23, 'ИЗО', '1', 0, 20, 'Холл', 10, 0, time(), time(), 1000, 1000],
            [1000, 1003, 401, 'Помещение звукооператора', '4', 0, 2, '', 10, 0, time(), time(), 1000, 1000],

        ])->execute();

        $this->createIndex('building_id', 'auditory', 'building_id');
        $this->createIndex('cat_id', 'auditory', 'cat_id');
        $this->addForeignKey('auditory_ibfk_1', 'auditory', 'cat_id', 'guide_auditory_cat', 'id', 'NO ACTION', 'NO ACTION');
        $this->addForeignKey('auditory_ibfk_2', 'auditory', 'building_id', 'guide_auditory_building', 'id', 'NO ACTION', 'NO ACTION');
    }

    public function down()
    {
        $this->dropForeignKey('auditory_ibfk_1', 'auditory');
        $this->dropForeignKey('auditory_ibfk_2', 'auditory');
        $this->dropTableWithHistory('auditory');
        $this->dropTable('guide_auditory_building');
        $this->dropTable('guide_auditory_cat');
    }
}
